views/cuenta/index.php

            <label id="<?=$c->codigo?>" for="item-<?=$c->codigo?>"><?=$c->codigo . " " . $c->concepto?> </label>
            <ul>
            <?php
$subCuentas = SubCuenta::find()->where(['=', 'id_cuenta', $c->id])->all();
---
SELECT * FROM `subcuenta` WHERE `id_cuenta` = 1