views/estado-cuenta/generar_debito.php

SELECT `id`, `concepto` FROM `subcuenta` WHERE (`codigo` < '4.2') AND (`codigo` > '4.1')
---

        <div class="col-md-2"><?=$form->field($model, 'socio_hasta')->textInput(['value' => 99999999])?></div>
    </div>
	<?php $list = ArrayHelper::map(SubCuenta::find()->select('id,concepto')->where(['<', 'codigo', '4.2'])->andWhere(['>', 'codigo', '4.1'])->all(), 'id', 'concepto')?>