controllers/CuentaController.php

SELECT * FROM `cuenta`
SELECT * FROM `subcuenta`
---
	public function actionIndex() {
		$cuenta = Cuenta::find()->all();
		$subcuenta = SubCuenta::find()->all();

INSERT INTO `subcuenta` (`codigo`, `concepto`, `id_cuenta`) VALUES ('1.1.3.1', 'caca', 0)
SELECT * FROM `subcuenta` WHERE `codigo` = '1.1.3'
---
	public function actionCreateSc() {
		//var_dump("finnn");die;
		$model = new SubCuenta();
		$post = $post = Yii::$app->request->post();
		$model->codigo = $post['codigo'];
		$model->concepto = $post['concepto'];

		$codigo = $post['codigo'];
		$idsubcuenta = $post['idsubcuenta'];
		$id_cuenta = $post['id_cuenta'];

		// si la cantidad es 1 guardo la subcuenta en la tabla subcuenta con id_cuenta de la cuenta principal
		if (strlen($id_cuenta) == 1) {
			$model->id_cuenta = $id_cuenta;
			// GUARDO
			if (!$model->save()) {
				throw new \yii\web\HttpException(400, 'Wrong method a', 405);
			}
		} else {
			//si es mas de uno ej: 1.1 guardo el la tabla subcuenta en el campo nsubcuenta
			//guardo cero por q no correspond a una cuenta principal si no a una subcuenta
			$model->id_cuenta = "0";
			// GUARDO
			if (!$model->save()) {
				throw new \yii\web\HttpException(400, 'Wrong method b', 405);
			} else {
				//grabo y busco la subcuenta con el codigo para agregar al campo nsubcuenta el id de la nueva subcuenta para poder relacionarla/*
				$modelo = SubCuenta::find()
					->where(['=', 'codigo', $id_cuenta])
					->one();

SELECT * FROM `subcuenta` WHERE `id` = '9'
SELECT * FROM `subcuenta` WHERE `id_cuenta` = '4.1.1.2' ORDER BY `codigo` DESC LIMIT 1
---
	public function actionUltimaSc() {

		try {
			$post = $post = Yii::$app->request->post();
			$codigo = $post['codigo_sc'];
			// busco la subcuenta
			$model = SubCuenta::find()->where(['=', 'codigo', $codigo])->one();

			// verifico que tenga subcuentas
			if ($model->nsubcuenta != null) {
				$id = explode("-", $model->nsubcuenta);
				$count = count($id);
				//busco ese id "3" el codigo para poder devolverlo, sumarle 1  y mostrarlo
				$modelo = SubCuenta::find()->where(['=', 'id', $id[$count - 1]])->one();
				//extraigo el codigo
				$idsc = explode(".", $modelo->codigo);
				//cuento cuantos nros son
				$countsc = count($idsc);
				// si tiene nros que es obvio pero igual :)
				if ($countsc > 0) {
					//extraigo todo el codigo menos el utlimo nro para despues sumarle uno y obtener el codigo siguiente
					$cantidad = strlen($modelo->codigo);
					$extcod = substr($modelo->codigo, 0, $cantidad - 1);
					//formo el nuevo numero
					$nuevo_nro = $extcod . ($idsc[$countsc - 1] + 1);
					echo $nuevo_nro;
				}
			} else {
				// si es null busco en el campo id_cuenta
				$mo = SubCuenta::find()->where(['=', 'id_cuenta', $codigo])->orderBy('codigo DESC')->limit(1)->one();