controllers/EstadoCuentaController.php

SELECT * FROM `socio_debito` WHERE (`id_socio` >= '1') AND (`id_socio` <= '1') ORDER BY `id_socio`
---
	public function actionGenerarDebito() {

		$model = new EstadoCuenta(['scenario' => 'generardebito']);

		if ($model->load(Yii::$app->request->post())) {
			//var_dump($model);die;
			// obtengo todos los registro de la tabla socio_debito con los parametros socio_desde y socio_hasta
			// para luego consultar con el campo id_debito en la tabla "debito" obtener datos de la tabla.
			$modelSD = SocioDebito::find()->where(['>=', 'id_socio', $model->socio_desde])->andWhere(['<=', 'id_socio', $model->socio_hasta])->orderBy('id_socio ASC')->all();

SELECT * FROM `estado_cuenta` WHERE ((`socio_id` >= '1') AND (`socio_id` <= '2')) AND (`periodo_anio`='2015') ORDER BY `socio_id`, `periodo_mes`
---
	public function actionImprimirGD($socio_desde, $socio_hasta,$periodo_mes_desde,$periodo_mes_hasta, $subcuenta_id) {
		//var_dump($periodo_mes_desde);die;
		$anio_actual= date("Y");
		if ($subcuenta_id == 0) {
			$socio = EstadoCuenta::find()->where(['>=', 'socio_id', $socio_desde])->andWhere(['<=', 'socio_id', $socio_hasta])->andWhere(['periodo_anio'=>$anio_actual])->orderBy('socio_id,periodo_mes ASC')->all();