controllers/MovimientoController.php

	public function actionGenerarDebito() {

		$model = new Movimiento(['scenario' => 'generardebito']);

		if ($model->load(Yii::$app->request->post())) {

			//traigo todos los socios
			$modelS = Socio::find()
			->where(['>=', 'id', $model->socio_desde])
			->andWhere(['<=', 'id', $model->socio_hasta])
			->andWhere(['fecha_baja'=> null])
			->orderBy('id ASC')
			->all();

			// por cada socio
			foreach ($modelS as $s) {

				// busco los debitos que tiene el socio
				$modelSD = SocioDebito::findAll(['id_socio' => $s->id]);
---
SELECT * FROM `debito` WHERE `id`=19