controllers/MovimientoController.php

SELECT `movimiento_detalle`.* FROM `movimiento_detalle` LEFT JOIN `movimiento` ON `movimiento_detalle`.`movimiento_id` = `movimiento`.`id` WHERE (((`periodo_mes` IS NULL) AND (`periodo_anio`='2015')) AND (`subcuenta_id`='42')) AND (`movimiento`.`fk_cliente`='5')
---
	public function actionIndex($v) {

		$model = new Movimiento();

		/***************  POST  ****************/
		if ($model->load(Yii::$app->request->post())) {

			$model->fecha_pago = date('Y-m-d', strtotime($model->fecha_pago));
			$post = Yii::$app->request->post();

			if ($v == 'i') {
				$title = "Ingresos";
				$modelR = Recibo::find()->where(['id' => 1])->one();
				$modelR->i = $model->nro_recibo;
				//actualizo nro recibo tabla recibo
				if (!$modelR->save()) {
					throw new \yii\web\HttpException(400, 'Error al guardar el ingreso');
				}
				$nro_recibo = $model->nro_recibo;
				$periodo_mes = $model->periodo_mes;
				$periodo_anio = $model->periodo_anio;
				$socio = $model->fk_cliente;
				// guardo por cada debito un registro en la tabla moviemietp de talle
				foreach ($post['importe'] as $key => $value) {

					// VERIFICAR SI EL INGRESO YA EXISTE. SI EXISTE LO ACTUALIZO , SI NO LO AGREGO
					$modelmd = MovimientoDetalle::find() // es mas simple usando hasmany, pero bue..me la mande :)
						->joinWith('movimiento')
						->where(['periodo_mes' => $model->periodo_mes])
						->andWhere(['periodo_anio' => $model->periodo_anio])
						->andWhere(['subcuenta_id' => $post['debito_sc_id'][$key]])
						->andWhere(['movimiento.fk_cliente' => $socio])->one();

SELECT * FROM `socio` WHERE (`id` >= '1') AND (`id` <= '99999999') ORDER BY `id`
SELECT * FROM `socio_debito` WHERE `id_socio`=1
INSERT INTO `movimiento` (`fk_cliente`) VALUES (1)
---
	public function actionGenerarDebito() {

		$model = new Movimiento(['scenario' => 'generardebito']);

		if ($model->load(Yii::$app->request->post())) {
			// obtengo todos los registro de la tabla socio_debito con los parametros socio_desde y socio_hasta
			// para luego consultar con el campo id_debito en la tabla "debito" obtener datos de la tabla.
			$modelS = Socio::find()->where(['>=', 'id', $model->socio_desde])->andWhere(['<=', 'id', $model->socio_hasta])->orderBy('id ASC')->all();

			$i = 0;
			// por cada socio
			foreach ($modelS as $s) {

				if ($i == 0) {
					$idSocio = $s->id;
					$i = $i + 1;
				}
				//verifico que no este dado de baja
				if ($s->fecha_baja == null) {
					// busco los debitos que tiene el socio
					$modelSD = SocioDebito::findAll(['id_socio' => $s->id]);

					// genero las cuotas a partir de los perido desde hasta del año actual
					//for ($f=$model->periodo_mes_desde; $f <=$model->periodo_mes_desde ; $f++) {
					// doy de alta en movimiento el socio para luego agregar los debitos en la tabla movimiento detalle
					$mMovimiento = new Movimiento();
					$mMovimiento->fk_cliente = $s->id;
					if (!$mMovimiento->save()) {

SELECT `movimiento_detalle`.* FROM `movimiento_detalle` LEFT JOIN `movimiento` ON `movimiento_detalle`.`movimiento_id` = `movimiento`.`id` WHERE (((`movimiento`.`fk_cliente`=1) AND (`subcuenta_id`=38)) AND (`periodo_mes`='1')) AND (`periodo_anio`='2015')
---
						//por cada debito del socio
						foreach ($modelSD as $sd) {
							//verificar si ya se genero esa cuota
							$verificar = MovimientoDetalle::find()
								->joinWith('movimiento')
								->where(['movimiento.fk_cliente' => $s->id])
								->andWhere(['subcuenta_id' => $sd->debito->subcuenta_id])
								->andWhere(['periodo_mes' => $model->periodo_mes_desde])
								->andWhere(['periodo_anio' => $model->periodo_anio])->one();

SELECT * FROM `movimiento` WHERE `id`='170'
SELECT * FROM `movimiento_detalle` WHERE `movimiento_id`=170
---
	public function actionImprimirReciboIngreso($id) {

		$m = Movimiento::find()->where(['id' => $id])->one();
		$modelDetalle = MovimientoDetalle::find()->where(['movimiento_id' => $m->id])->all();

SELECT * FROM `socio`
SELECT * FROM `categoria_social`
SELECT * FROM `debito`
---
	public function actionConsultaEstadoCuenta() {


		if (Yii::$app->request->post()) {

			$post = Yii::$app->request->post();

			$fecha_desde = date('Y-m-d', strtotime($post['fecha_desde']));

			$fecha_hasta = date('Y-m-d', strtotime($post['fecha_hasta']));

			var_dump($post['deportes']);die;

			$mpdf = new mPDF('utf-8', 'A4');
			$mpdf->WriteHTML($this->renderPartial('_imprimir_egresos', [
				'fecha_desde' => $fecha_desde,
				'fecha_hasta' => $fecha_hasta,
			]));
			$mpdf->Output();
			exit;

		}


		$consultaSocios = Socio::find()->all();
		// formo el array socio con el dni concatenado ;)
	 	foreach ($consultaSocios as $cs) {
            $socios[$cs['id']] = $cs['apellido_nombre'] . "  - Dni:  ". $cs['dni'] ;
        }

		$consultaCategorias = CategoriaSocial::find()->all();
		$categorias = ArrayHelper::map($consultaCategorias, 'id', 'descripcion');

	 	$consultaDebitos = Debito::find()->asArray()->all();