views/generar-deuda/index.php


    <?= $form->field($model, 'socio_hasta')->textInput(['value'=>99999999]) ?>

	<?php $list = ArrayHelper::map(SubCuenta::find()->select('id,concepto')->where(['<', 'codigo', '4.2'])->andWhere(['>', 'codigo', '4.1'])->all(), 'id', 'concepto');?>
---
SELECT `id`, `concepto` FROM `subcuenta` WHERE (`codigo` < '4.2') AND (`codigo` > '4.1')