views/movimiento/estado_cuenta.php

SELECT * FROM `subcuenta` WHERE `id`=38
---
        }*/
    },
    'summary' => '',
    'columns' => [
        [
            'attribute' => 'Nro Rec.',
            'value' => function ($model) {
                if ($model->nro_recibo == "") {
                    return "-";
                } else {
                    return $model->nro_recibo;
                }
            },
        ],
        'socio.apellido_nombre',
        [
            'attribute' => 'Concepto',
            'value' => function ($model) {
                $movmd = MovimientoDetalle::find()->where(['movimiento_id'=>$model->id])->all();
                if (!empty($movmd)){
                    foreach ($movmd as $md ) {
                        $conceptos = $md->subCuenta->concepto . " $". $md->importe . " - ". $conceptos;
                    }
                    return $conceptos;