views/movimiento/generar_debito.php

SELECT `id`, `concepto` FROM `subcuenta` WHERE (`codigo` < '4.2') AND (`codigo` > '4.1')
---
    </div>

    <div class="row">
        <?php $list = ArrayHelper::map(SubCuenta::find()->select('id,concepto')->where(['<', 'codigo', '4.2'])->andWhere(['>', 'codigo', '4.1'])->all(), 'id', 'concepto')?>