views/movimiento/index.php



<?php   if ($tipo == "i") { // si la variable es "i" (ingresos) traigo todos los socios y cuentas de resultado positivo 4.1
            $list = ArrayHelper::map(Socio::find()->orderBy('apellido_nombre')->all(), 'id', 'apellido_nombre');?>
---
SELECT * FROM `socio` ORDER BY `apellido_nombre`

<?php }
// si la variable es "e" (engresos) traigo todos los proveedores y cuentas de resultado negativo 4.2
else {
	       $list = ArrayHelper::map(Proveedor::find()->orderBy('nombre')->all(), 'id', 'nombre');
---
SELECT * FROM `proveedor` ORDER BY `nombre`