models/Cuenta.php

	public function getLastId() {

		$query = self::find()
			->select('codigo')
			->orderBy('codigo DESC')->one();
---
SELECT `codigo` FROM `cuenta` ORDER BY `codigo` DESC