models/Debito.php

SELECT * FROM `debito`
---
    public function getListConceptoImporte() {

        $query=  self::find()->asArray()->all();