models/Movimiento.php

	public function getAllEstadoCuentaByNombre($nombre) {

		$mes_actual = date('m');
		$anio_actual = date('Y');
		$socio = Socio::find()->where(['like', 'apellido_nombre', $nombre . '%', false])->one();
---
SELECT * FROM `socio` WHERE `apellido_nombre` LIKE 'cejas%'