models/Recibo.php

SELECT `i` FROM `recibo` WHERE `id`=1
SELECT `e` FROM `recibo` WHERE `id`=1
---
	public function getLastNroRecibo($v) {

		if ($v == 'i') {

			$query = self::find()->select('i')->where(['id' => 1])->one();

			if ($query == "") {
				$valor = 1;
			} else {
				$valor = $query->i + 1;
			}

		} else {

			$query = self::find()->select('e')->where(['id' => 1])->one();