models/SubCuenta.php

SELECT * FROM `subcuenta` WHERE `id` = '3'
---
	public function recursividad($sc) {

		if (empty($sc->nsubcuenta) || $sc->nsubcuenta == null) {

			if ($sc != null){
				echo "
					<li>
						<input type='checkbox' id='item-" . $sc->codigo . "' value=" . $sc->codigo . " />
						<label for='item-" . $sc->codigo . "'" . ">" . $sc->codigo . " " . $sc->concepto . "</label>
					</li>
				";
			}else{
				echo"";
			}

			return;
		} else {

			echo "<li>
					<input type='checkbox' id='item-" . $sc->codigo . "' value=" . $sc->codigo . " />
					<label for='item-" . $sc->codigo . "'" . ">" . $sc->codigo . " " . $sc->concepto . "</label>
					<ul>
			";

			// extraer las subcuentas y devuelve array con los id de subcuenta
			$extraer = explode('-', $sc->nsubcuenta);
			//recorro el array por cada subcuenta
			foreach ($extraer as $valor) {
				// busco subcuenta con el id
				//echo $sc[$valor];die;
				$subCuentas = SubCuenta::find()
					->where(['=', 'id', $valor])
					->one();